external/swak/examples/SimpleSurface/littleVolcano/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*
Caelus 6.10
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-10 -10 0)
    (  5 -10 0)
    (  5   5 0)
    (-10   5 0)
    (-10 -10 5)
    (  5 -10 5)
    (  5   5 5)
    (-10   5 5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 60 20) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall sea
    (
        (0 3 2 1)
    )
    patch outside
    (
        (1 5 4 0)
        (3 7 6 2)
        (0 4 7 3)
        (2 6 5 1)
    )
    patch sky
    (
        (4 5 6 7)
    )
);

mergePatchPairs
(
);


// ************************************************************************* //
