external/swak/examples/SimpleSurface/littleVolcano/0/p_rgh
/*---------------------------------------------------------------------------*
Caelus 6.10
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    volcano_inlet
    {
        type            zeroGradient;
    }

    sky
    {
        type            fixedValue;
        value           uniform 0;
    }

    outside
    {
        $sky;
    }

    volcano_wall
    {
        type            fixedFluxPressure;
        adjoint         no;
    }

    "land.+"
    {
        $volcano_wall;
    }

    sea
    {
        type zeroGradient;
    }
}


// ************************************************************************* //
