external/swak/examples/SimpleSurface/littleVolcano/system/setFieldsDict
/*---------------------------------------------------------------------------*
Caelus 6.10
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha1 0
);

regions
(
    boxToCell
    {
        box (0 0 -1) (1 8e-3 1);

        fieldValues
        (
            volScalarFieldValue alpha1 1
        );
    }
);


// ************************************************************************* //
